Revit 2026 API

# AnalyticalMemberSetReleaseConditions Method

---

Sets Release Conditions to Analytical Member.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetReleaseConditions(
	ReleaseConditions releaseConditions
)
```
```vb
Public Sub SetReleaseConditions (
	releaseConditions As ReleaseConditions
)
```
```cpp
public:
void SetReleaseConditions(
	ReleaseConditions^ releaseConditions
)
```
```fsharp
member SetReleaseConditions :
        releaseConditions : ReleaseConditions -> unit
```

#### Parameters

releaseConditions ReleaseConditions
     End to which release conditions will be added is defined by setting [!:Autodesk::Revit::DB::Structure::ReleaseConditions::Position] property in provided release conditions object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If element already have release conditions defined for that end, newly provided values replace current one. The ReleaseType will be set to UserDefined.

#### Reference

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace